libs/Schema_Analyzer_Library/src/test/resources/soap11_example_signed_message.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:stud="http://studentsoapactionspoofingteaching.xml.nds.rub.de">
   <soapenv:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><ds:Signature Id="SIG-6" xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces PrefixList="soapenv stud" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#id-2"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces PrefixList="stud" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>E/qpcn1TIBRUdKtv2oVAuAUxy68=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>ddTBPA29DEpxjrR5twlDgUX6OgyEnNRhuwCSTLkM3oO3B0uts9/HclgE/Ynm/0CLZv16iVpiYu3T
sRiGaykEc46OqJEAt81R7cMJv2KC6LRcHScamqeMcS/s/kk7Tfsuqaw7lBCWZ3WkrkZvUr4gQrk5
HPO/ZCMjq7+rcP74HY0=</ds:SignatureValue><ds:KeyInfo Id="KI-D31D2F45B8AE7D66F6136854008844711"><wsse:SecurityTokenReference wsu:Id="STR-D31D2F45B8AE7D66F6136854008844712"><ds:X509Data><ds:X509IssuerSerial><ds:X509IssuerName>CN=Sample Client,OU=Rampart,O=Apache,L=Colombo,ST=Western,C=LK</ds:X509IssuerName><ds:X509SerialNumber>1261391591</ds:X509SerialNumber></ds:X509IssuerSerial></ds:X509Data></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></soapenv:Header>
   <soapenv:Body wsu:Id="id-2" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
      <stud:calculateSecret>
         <!--Optional:-->
         <stud:i>1</stud:i>
      </stud:calculateSecret>
   </soapenv:Body>
</soapenv:Envelope>